log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** The Haskell Cabal and Cross Compilation
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-05-17-the-haskell-cabal-and-cross-compilation
   :EXPORT_DATE: <2017-05-17>
   :ID:       2216B462-553D-47F5-9B13-6B39B3F772BE
   :END:

Once you want to tap into the vast ecosystem of haskell libraries, you
will run into cabal and hackage in one way or the other /(stack and
stackage build upon cabal as well)/. Over the last few days we [[https://medium.com/@zw3rk/quick-headless-raspberry-pi-setup-52ad6dd312c4][set up]]
the [[http://amzn.to/2roKzUZ][Raspberry Pi]], built the [[https://medium.com/@zw3rk/making-a-raspbian-cross-compilation-sdk-830fe56d75ba][Raspbian SDK]] and the [[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-raspberry-pi-ddd9d41ced94][Haskell cross
compiler]]. Today we will look at what cabal is, and how to use it for
cross compilation.

*** Cabal, cabal-install, cabal and Hackage
    :PROPERTIES:
    :ID:       08747E48-4FCD-4C06-BC00-3AD70C058B13
    :END:

The *C*ommon *A*rchitecture for *B*uilding *A*pplications and
*L*ibraries consists of [[https://www.haskell.org/cabal/][/Cabal/]] the
library. /Cabal/ the library contains the logic how to build a haskell
package from a =.cabal= file. /cabal-install/ is the cabal package, that
provides the =cabal= command.
[[https://hackage.haskell.org/][/Hackage/]] finally is the haskell
package repository.

As an end user you will mostly deal with =cabal= the command line
interface. This will also take care of downloading dependencies and
building them as required.

*** Cross Compiling with =cabal=
    :PROPERTIES:
    :ID:       B4B0ECB9-4949-46E1-989E-439B4B2F74F9
    :END:

cabal is not yet very cross compilation agnostic. As cross compilation
has been mostly a niche, cross compiling packages with cabal needs some
hand-holding.

By default =cabal= will use a non-prefixed toolchain, which results in
the library being compiled for the /build/ machine. In the cross
compilation setting, we want to compile for the /host/ machine. That is
the machine that will /host/ the final binary, and not the machine that
/builds/ the binary.

Luckily =cabal= provides the necessary arguments to pass in the
toolchain we want to use /(I've seen this first in the/
[[https://github.com/ghc-ios/ghc-ios-scripts][/ghc-ios-scripts/]]/)/.

For our =arm-linux-gnueabihf-ghc= we
[[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-raspberry-pi-ddd9d41ced94][built
yesterday]] we want to effectively call =cabal= with the following
arguments:

#+BEGIN_EXAMPLE
  --builddir=dist/arm-linux-gnueabihf
#+END_EXAMPLE

to put any build product into a separate directory for each
architecture. And

#+BEGIN_EXAMPLE
  --with-ghc=arm-linux-gnueabihf-ghc
  --with-ghc-pkg=arm-linux-gnueabihf-ghc-pkg
  --with-gcc=arm-linux-gnueabihf-clang
  --with-ld=arm-linux-gnueabihf-ld
#+END_EXAMPLE

to teach cabal about our toolchain. cabal may call =hsc2hs= as well,
passing

#+BEGIN_EXAMPLE
  --hsc2hs-options=--cross-compile
#+END_EXAMPLE

when compiling ensures that =hsc2hs=
[[http://downloads.haskell.org/~ghc/master/users-guide/utils.html#hsc2hs-cross][operates
in cross compilation mode]].

Finally =cabal= may invoke =configure=. Therefore we pass

#+BEGIN_EXAMPLE
  --configure-option=--host=arm-linux-gnueabihf
#+END_EXAMPLE

as well, when running =cabal configure= or =cabal install=, so that
configure scripts can rely on the proper =--host= flag.

Passing all this by hand is truly annoying. Therefore let us create a
wrapper script for this /(again credit for this goes to/
[[https://github.com/ghc-ios/ghc-ios-scripts][/ghc-ios-scripts/]]/,
where I saw this approach first --- we will use a slightly modified
version here)./

Let us create a script called =cabal-wrapper= with the following
content:

#+BEGIN_EXAMPLE
  #!/bin/bash

  name=${0##*/}
  cmd=${name##*-}
  target=${name%-*}

  fcommon="--builddir=dist/${target}"
  fcompile=" --with-ghc=${target}-ghc"
  fcompile+=" --with-ghc-pkg=${target}-ghc-pkg"
  fcompile+=" --with-gcc=${target}-clang"
  fcompile+=" --with-ld=${target}-ld"
  fcompile+=" --hsc2hs-options=--cross-compile"
  fconfig="--disable-shared --configure-option=--host=${target}"

  case $1 in
    configure|install) flags="${fcommon} ${fcompile} ${fconfig}" ;;
    build)             flags="${fcommon} ${fcompile}" ;;
    list|info|update)  flags="" ;;
    "")                flags="" ;;
    *)                 flags=$fcommon ;;
  esac

  exec $cmd $flags "$@"
#+END_EXAMPLE

/Note: for simplicity we do not wrap/ =cabal='s new
[[http://blog.ezyang.com/2016/05/announcing-cabal-new-build-nix-style-local-builds/][/nix-style
local build commands/]] /like/ =new-build=, and =new-install=.

Simply creating a symbolic link

#+BEGIN_EXAMPLE
  ln -s cabal-wrapper arm-linux-gnueabihf-cabal
#+END_EXAMPLE

provides us with =arm-linux-gnueabihf-cabal= which nicely fits in with
the rest of the toolchain we built so far. And we can use
=arm-linux-gnueabihf-cabal= just like =cabal= to build or install
haskell packages to use with the cross compiler.

*** Be Aware of build-type: Custom
    :PROPERTIES:
    :ID:       8BFC1A54-3716-4D3C-A726-CD2388D5221E
    :END:

Cabal provides an escape hatch for to support custom build types, for
when the =build-type: Simple= is not sufficient. Unfortunately this
requires the =Setup.hs= to be built by cabal and run, and cabal default
to using the =ghc= is knows about to compile the =Setup.hs=. This then
leads to a =Setup.hs= that is compiled with the cross compiling ghc
(here: =arm-linux-gnueabihf-ghc=), and can only be run on the /host/,
but not on the /build/ machine. Ideally cabal would be cross compilation
aware and compile the =Setup.hs= with the compiler that targets the
/build/ machine.

As quite a few packages use =build-type: Custom= for the purpose of
supporting =doctest= or =haddock=. Often times just rewriting
=build-type: Custom= to =build-type: Simple= can make a package succeed
to compile for cross compilation. /(An alternative solution, that tries
to respect the/ =build-type: Custom=/, can be found in the/
[[https://github.com/ghc-ios/ghc-ios-scripts/blob/master/i386-apple-darwin11-cabal-custom][/cabal-custom/]]
/script, again from the/
[[https://github.com/ghc-ios/ghc-ios-scripts][/ghc-ios-scripts/]]/)/

*** Be Aware of Template Haskell
    :PROPERTIES:
    :ID:       CC68DBE6-2E2D-4673-ABFE-B11344F719FD
    :END:

Template Haskell provides interesting challenges for cross compilation.
For a long time Template Haskell was simply not an option for cross
compilation. While there are
[[https://git-annex.branchable.com/design/assistant/blog/day_236__evil_splicer/][evil
splicer]] and [[https://hackage.haskell.org/package/zeroth][ZeroTH]],
which try to work around Template Haskell, there has been no proper
Template Haskell support. However
[[https://github.com/ghcjs/ghcjs][GHCJS]] does support Template Haskell
and is a cross compiler as well, and the same approach can be taken with
GHC. Cross compiling and Template Haskell will the the main topic for
next week.

